Revit 2024 API
PolylineSegments Class
 An output node that represents a tessellated polyline segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class PolylineSegments : IDisposable
Visual Basic
Public Class PolylineSegments _
	Implements IDisposable
Visual C++
public ref class PolylineSegments : IDisposable
Remarks
 See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolylineSegments].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PolylineSegments
See Also
PolylineSegments Members
Autodesk.Revit.DB Namespace